yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/i2c_reg.h
/**************************************************************************//**
 * @file     i2c_reg.h
 * @version  V1.00
 * @brief    I2C register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __I2C_REG_H__
#define __I2C_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

/**
   @addtogroup REGISTER Control Register
   @{
*/


/*---------------------- Inter-IC Bus Controller -------------------------*/
/**
    @addtogroup I2C Inter-IC Bus Controller(I2C)
    Memory Mapped Structure for I2C Controller
    @{
*/

typedef struct
{
/**
 * @var I2C_T::CTL0
 * Offset: 0x00  I2C Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2]     |AA        |Assert Acknowledge Control
 * |        |          |When AA =1 prior to address or data is received, an acknowledged (low level to SDA) will be returned during the acknowledge clock pulse on the SCL line when 1.)
 * |        |          |A slave is acknowledging the address sent from master, 2.) The receiver devices are acknowledging the data sent by transmitter
 * |        |          |When AA=0 prior to address or data received, a Not acknowledged (high level to SDA) will be returned during the acknowledge clock pulse on the SCL line
 * |[3]     |SI        |I2C Interrupt Flag
 * |        |          |When a new I2C state is present in the I2C_STATUS0 register, the SI flag is set by hardware
 * |        |          |If bit INTEN (I2C_CTL0 [7]) is set, the I2C interrupt is requested
 * |        |          |SI must be cleared by software
 * |        |          |Clear SI by writing 1 to this bit.
 * |        |          |For ACKMEN is set in slave read mode, the SI flag is set in 8th clock period for user to confirm the acknowledge bit and 9th clock period for user to read the data in the data buffer.
 * |[4]     |STO       |I2C STOP Control
 * |        |          |In Master mode, setting STO to transmit a STOP condition to bus then I2C controller will check the bus condition if a STOP condition is detected
 * |        |          |This bit will be cleared by hardware automatically.
 * |[5]     |STA       |I2C START Control
 * |        |          |Setting STA to logic 1 to enter Master mode, the I2C hardware sends a START or repeat START condition to bus when the bus is free
 * |        |          |This bit will be cleared by hardware automatically.
 * |[6]     |I2CEN     |I2C Controller Enable Bit
 * |        |          |Set to enable I2C serial function controller
 * |        |          |When I2CEN=1 the I2C serial function enable
 * |        |          |The multi-function pin function must set to SDA, and SCL of I2C function first.
 * |        |          |0 = I2C controller Disabled.
 * |        |          |1 = I2C controller Enabled.
 * |[7]     |INTEN     |Enable Interrupt
 * |        |          |0 = I2C interrupt Disabled.
 * |        |          |1 = I2C interrupt Enabled.
 * @var I2C_T::ADDR0
 * Offset: 0x04  I2C Slave Address Register0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[10:1]  |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chipu2019s own address
 * |        |          |The I2C hardware will react if either of the address is matched.
 * |        |          |Note: When software set 10u2019h000, the address cannot be used.
 * @var I2C_T::DAT
 * Offset: 0x08  I2C Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DAT       |I2C Data
 * |        |          |Bits [7:0]: 8-bit data transferred or received via the I&sup2;C serial port.
 * |        |          |Bits [31:8]: Used in FIFO Mode for additional data storage.
 * @var I2C_T::STATUS0
 * Offset: 0x0C  I2C Status Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |STATUS    |I2C Status
 * |        |          |The three least significant bits are always 0
 * |        |          |The five most significant bits contain the status code
 * |        |          |There are 28 possible status codes
 * |        |          |When the content of I2C_STATUS0 is F8H, no serial interrupt is requested
 * |        |          |Others I2C_STATUS0 values correspond to defined I2C states
 * |        |          |When each of these states is entered, a status interrupt is requested (SI = 1)
 * |        |          |A valid status code is present in I2C_STATUS0 one cycle after SI is set by hardware and is still present one cycle after SI has been reset by software
 * |        |          |In addition, states 00H stands for a Bus Error
 * |        |          |A Bus Error occurs when a START or STOP condition is present at an illegal position in the formation frame
 * |        |          |Example of illegal position are during the serial transfer of an address byte, a data byte or an acknowledge bit.
 * @var I2C_T::CLKDIV
 * Offset: 0x10  I2C Clock Divided Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[9:0]   |DIVIDER   |I2C Clock Divided
 * |        |          |Indicates the I2C clock rate: Data Baud Rate of I2C = (system clock) / (4x (DIVIDER+1)).
 * |        |          |Note: The minimum value of DIVIDER is 4.
 * |[15:12] |NFCNT     |Noise Filter Count
 * |        |          |The register bits control the input filter width
 * |        |          |If the pulse width is narrower than the setting((3+N)*PCLK), it will be ignored.
 * |        |          |0 : filter width 3*PCLK
 * |        |          |1 : filter width 4*PCLK
 * |        |          |N : filter width (3+N)*PCKL
 * |        |          |Note: Filter width Min :3*PCLK, Max : 18*PCLK
 * @var I2C_T::TOCTL
 * Offset: 0x14  I2C Time-out Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TOIF      |Time-out Flag
 * |        |          |This bit is set by hardware when I2C time-out happened and it can interrupt CPU if I2C interrupt enable bit (INTEN) is set to 1.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[1]     |TOCDIV4   |Time-out Counter Input Clock Divided by 4
 * |        |          |When enabled, the time-out period is extended 4 times.
 * |        |          |0 = Time-out period is extend 4 times Disabled.
 * |        |          |1 = Time-out period is extend 4 times Enabled.
 * |        |          |Note: This bit only worked when I2C_TOCTL[3] is set to 0.
 * |[2]     |TOCEN     |Time-out Counter Enable Bit
 * |        |          |When enabled, the 14-bit time-out counter will start counting when SI is cleared
 * |        |          |Setting flag SI to u20181u2019 will reset counter and re-start up counting after SI is cleared.
 * |        |          |0 = Time-out counter Disabled.
 * |        |          |1 = Time-out counter Enabled.
 * |[3]     |TOBAUD    |Time-out Counter Input Clock Using Baud Rate Frequency
 * |        |          |When enabled, the time-out counter is using baud rate.
 * |        |          |0 = Time-out counter is using PCLK or PCLK/4.
 * |        |          |1 = Time-out counter is using I&sup2;C baud rate.
 * |[8]     |TONIDLE   |Time-out Counter Disable in IDLE State
 * |        |          |When set 1,Time-out counter will stop.
 * |        |          |0 = Timeout counter enable when in IDLE state
 * |        |          |1 = Timeout counter disable when in IDLE state
 * @var I2C_T::ADDR1
 * Offset: 0x18  I2C Slave Address Register1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[10:1]  |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chipu2019s own address
 * |        |          |The I2C hardware will react if either of the address is matched.
 * |        |          |Note: When software set 10u2019h000, the address cannot be used.
 * @var I2C_T::ADDR2
 * Offset: 0x1C  I2C Slave Address Register2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[10:1]  |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chipu2019s own address
 * |        |          |The I2C hardware will react if either of the address is matched.
 * |        |          |Note: When software set 10u2019h000, the address cannot be used.
 * @var I2C_T::ADDR3
 * Offset: 0x20  I2C Slave Address Register3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[10:1]  |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chipu2019s own address
 * |        |          |The I2C hardware will react if either of the address is matched.
 * |        |          |Note: When software set 10u2019h000, the address cannot be used.
 * @var I2C_T::ADDRMSK0
 * Offset: 0x24  I2C Slave Address Mask Register0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:1]  |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is donu2019t care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is donu2019t-care
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * |        |          |Note: The wake-up function cannot use address mask in 10-bit mode.
 * @var I2C_T::ADDRMSK1
 * Offset: 0x28  I2C Slave Address Mask Register1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:1]  |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is donu2019t care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is donu2019t-care
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * |        |          |Note: The wake-up function cannot use address mask in 10-bit mode.
 * @var I2C_T::ADDRMSK2
 * Offset: 0x2C  I2C Slave Address Mask Register2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:1]  |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is donu2019t care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is donu2019t-care
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * |        |          |Note: The wake-up function cannot use address mask in 10-bit mode.
 * @var I2C_T::ADDRMSK3
 * Offset: 0x30  I2C Slave Address Mask Register3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:1]  |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is donu2019t care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is donu2019t-care
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * |        |          |Note: The wake-up function cannot use address mask in 10-bit mode.
 * @var I2C_T::WKCTL
 * Offset: 0x3C  I2C Wake-up Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKEN      |I2C Wake-up Enable Bit
 * |        |          |0 = I2C wake-up function Disabled.
 * |        |          |1= I2C wake-up function Enabled.
 * |[7]     |NHDBUSEN  |I2C No Hold BUS Enable Bit
 * |        |          |0 = I2C hold bus after wake-up.
 * |        |          |1= I2C donu2019t hold bus after wake-up.
 * |        |          |Note: The I2C controller could respond when WKIF event is not clear, it may cause error data transmitted or received
 * |        |          |If data transmitted or received when WKIF event is not clear, user must reset I2C controller and execute the original operation again.
 * @var I2C_T::WKSTS
 * Offset: 0x40  I2C Wake-up Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKIF      |I2C Wake-up Flag
 * |        |          |When chip is woken up from Power-down mode by I2C, this bit is set to 1
 * |        |          |Software can write 1 to clear this bit.
 * |[1]     |WKAKDONE  |Wakeup Address Frame Acknowledge Bit Done
 * |        |          |0 = The ACK bit cycle of address match frame isnu2019t done.
 * |        |          |1 = The ACK bit cycle of address match frame is done in power-down.
 * |        |          |Note: This bit canu2019t release WKIF. Software can write 1 to clear this bit.
 * |[2]     |WRSTSWK   |Read/Write Status Bit in Address Wakeup Frame
 * |        |          |0 = Write command be record on the address match wakeup frame.
 * |        |          |1 = Read command be record on the address match wakeup frame.
 * |        |          |Note: This bit will be cleared when software can write 1 to WKAKDONE bit.
 * @var I2C_T::CTL1
 * Offset: 0x44  I2C Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TXPDMAEN  |PDMA Transmit Channel Available
 * |        |          |0 = Transmit PDMA function Disabled.
 * |        |          |1 = Transmit PDMA function Enabled. 
 * |[1]     |RXPDMAEN  |PDMA Receive Channel Available
 * |        |          |0 = Receive PDMA function Disabled.
 * |        |          |1 = Receive PDMA function Enabled. 
 * |[2]     |PDMARST   |PDMA Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the I2C request to PDMA.
 * |[3]     |OVRIEN    |I2C over Run Interrupt Control Bit
 * |        |          |Setting OVRIEN to logic 1 will send a interrupt to system when the TWOBUFEN bit is enabled and there is over run event in received buffer.
 * |[4]     |UDRIEN    |I2C Under Run Interrupt Control Bit
 * |        |          |Setting UDRIEN to logic 1 will send a interrupt to system when the TWOBUFEN bit is enabled and there is under run event happened in transmitted buffer.
 * |[5]     |TWOBUFEN  |Two-level BUFFER Enable Bit
 * |        |          |0 = Two-level buffer Disabled.
 * |        |          |1 = Two-level buffer Enabled.
 * |        |          |Set to enable the two-level buffer for I2C transmitted or received buffer
 * |        |          |It is used to improve the performance of the I2C bus
 * |        |          |If this bit is set = 1, the control bit of STA for repeat start or STO bit should be set after the current SI is cleared
 * |        |          |For example: if there are 4 data shall be transmitted and then stop it
 * |        |          |The STO bit shall be set after the 3rd datau2019s SI event being clear
 * |        |          |In this time, the 4th data can be transmitted and the I2C stop after the 4th data transmission done.
 * |[8]     |PDMASTR   |PDMA Stretch Bit
 * |        |          |0 = I2C send STOP automatically after PDMA transfer done. (only master TX)
 * |        |          |1 = I2C SCL bus is stretched by hardware after PDMA transfer done if the SI is not cleared
 * |        |          |(only master TX)
 * |[9]     |ADDR10EN  |Address 10-bit Function Enable Bit
 * |        |          |0 = Address match 10-bit function Disabled.
 * |        |          |1 = Address match 10-bit function Enabled. 
 * |[10]    |SWITCHEN  |SCL and SDA Pin Switch Enable Bit
 * |        |          |0 = I&sup2;C use original pin configuration.
 * |        |          |1 = I&sup2;C switch SCL and SDA pin configuration.
 * |        |          |Note: Original pin configuration table is shown in Pin Configuration chapter.
 * |[12]    |STOPIEN   |Stop Interrupt Enable
 * |        |          |0 = No effect
 * |        |          |1 = It only issue IRQ Handler when STOP happenes.
 * |[17:16] |DPBITSEL  |Data Phase Bit Count Select
 * |        |          |00 = DPCIF never set by hardware.
 * |        |          |01 = When I2C is transfer data and bit count equal to 6, DPCIF will be set by hardware.
 * |        |          |10 = When I2C is transfer data and bit count equal to 7, DPCIF will be set by hardware.
 * |        |          |11 = When I2C is transfer data and bit count equal to 8, DPCIF will be set by hardware.
 * |[20]    |DPCINTEN  |Data Phase Count Interrupt Enable Bit
 * |        |          |0 = Data Phase Count Interrupt Disabled.
 * |        |          |1 = Data Phase Count Interrupt Enabled.
 * |[21]    |SRCINTEN  |Slave Read Command Interrupt Enable Bit
 * |        |          |0 = Slave Read Command Interrupt Disabled.
 * |        |          |1 = Slave Read Command Interrupt Enabled.
 * |        |          |Note: It only works when TWOBUFEN = 1.
 * |[24]    |FIFOEN    |FIFO Enable
 * |        |          |0 = No effect
 * |        |          |1 = Enable TX/RX FIFO.
 * |[25]    |FIFORST   |FIFO Reset
 * |        |          |0 = No effect
 * |        |          |1 = Reset all TX and RX FIFO.
 * |        |          |Note: It only works when FIFOEN = 1.
 * |[29:28] |FIFOTHRES |FIFO Depth Threshold
 * |        |          |For TX mode,an IRQ will be triggered when the TXFCNT = (4 - FIFOTHRES) bytes.
 * |        |          |For RX mode, an IRQ will be triggered when the RXFCNT = (4 + FIFOTHRES) bytes.
 * |        |          |Note: It only works when FIFOEN = 1.
 * @var I2C_T::STATUS1
 * Offset: 0x48  I2C Status Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADMAT0    |I2C Address 0 Match Status
 * |        |          |When address 0 is matched, hardware will inform which address used
 * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
 * |[1]     |ADMAT1    |I2C Address 1 Match Status
 * |        |          |When address 1 is matched, hardware will inform which address used
 * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
 * |[2]     |ADMAT2    |I2C Address 2 Match Status
 * |        |          |When address 2 is matched, hardware will inform which address used
 * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
 * |[3]     |ADMAT3    |I2C Address 3 Match Status
 * |        |          |When address 3 is matched, hardware will inform which address used
 * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
 * |[4]     |FULL      |TWO-LEVEL BUFFER FULL
 * |        |          |This bit indicates two-level buffer TX or RX full or not when the TWOBUFEN = 1.
 * |        |          |This bit is set when POINTER is equal to 2
 * |        |          |Note: This bit is read only.
 * |[5]     |EMPTY     |TWO-LEVEL BUFFER EMPTY
 * |        |          |This bit indicates two-level buffer TX or RX empty or not when the TWOBUFEN = 1.
 * |        |          |This bit is set when POINTER is equal to 0.
 * |        |          |Note: This bit is read only.
 * |[6]     |OVR       |I2C Over Run Status Bit
 * |        |          |This bit indicates the received two-level buffer TX or RX is over run when the TWOBUFEN = 1.
 * |        |          |Note: This bit is read only.
 * |[7]     |UDR       |I2C Under Run Status Bit
 * |        |          |This bit indicates the transmitted two-level buffer TX or RX is under run when the TWOBUFEN = 1.
 * |        |          |Note: This bit is read only.
 * |[8]     |ONBUSY    |On Bus Busy (Read Only)
