yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/i2c_reg.h
#define I2C_WKCTL_WKEN_Pos               (0)                                               /*!< I2C_T::WKCTL: WKEN Position            */
#define I2C_WKCTL_WKEN_Msk               (0x1ul << I2C_WKCTL_WKEN_Pos)                     /*!< I2C_T::WKCTL: WKEN Mask                */

#define I2C_WKCTL_NHDBUSEN_Pos           (7)                                               /*!< I2C_T::WKCTL: NHDBUSEN Position        */
#define I2C_WKCTL_NHDBUSEN_Msk           (0x1ul << I2C_WKCTL_NHDBUSEN_Pos)                 /*!< I2C_T::WKCTL: NHDBUSEN Mask            */

#define I2C_WKSTS_WKIF_Pos               (0)                                               /*!< I2C_T::WKSTS: WKIF Position            */
#define I2C_WKSTS_WKIF_Msk               (0x1ul << I2C_WKSTS_WKIF_Pos)                     /*!< I2C_T::WKSTS: WKIF Mask                */

#define I2C_WKSTS_WKAKDONE_Pos           (1)                                               /*!< I2C_T::WKSTS: WKAKDONE Position        */
#define I2C_WKSTS_WKAKDONE_Msk           (0x1ul << I2C_WKSTS_WKAKDONE_Pos)                 /*!< I2C_T::WKSTS: WKAKDONE Mask            */

#define I2C_WKSTS_WRSTSWK_Pos            (2)                                               /*!< I2C_T::WKSTS: WRSTSWK Position         */
#define I2C_WKSTS_WRSTSWK_Msk            (0x1ul << I2C_WKSTS_WRSTSWK_Pos)                  /*!< I2C_T::WKSTS: WRSTSWK Mask             */

#define I2C_CTL1_TXPDMAEN_Pos            (0)                                               /*!< I2C_T::CTL1: TXPDMAEN Position         */
#define I2C_CTL1_TXPDMAEN_Msk            (0x1ul << I2C_CTL1_TXPDMAEN_Pos)                  /*!< I2C_T::CTL1: TXPDMAEN Mask             */

#define I2C_CTL1_RXPDMAEN_Pos            (1)                                               /*!< I2C_T::CTL1: RXPDMAEN Position         */
#define I2C_CTL1_RXPDMAEN_Msk            (0x1ul << I2C_CTL1_RXPDMAEN_Pos)                  /*!< I2C_T::CTL1: RXPDMAEN Mask             */

#define I2C_CTL1_PDMARST_Pos             (2)                                               /*!< I2C_T::CTL1: PDMARST Position          */
#define I2C_CTL1_PDMARST_Msk             (0x1ul << I2C_CTL1_PDMARST_Pos)                   /*!< I2C_T::CTL1: PDMARST Mask              */

#define I2C_CTL1_OVRIEN_Pos              (3)                                               /*!< I2C_T::CTL1: OVRIEN Position           */
#define I2C_CTL1_OVRIEN_Msk              (0x1ul << I2C_CTL1_OVRIEN_Pos)                    /*!< I2C_T::CTL1: OVRIEN Mask               */

#define I2C_CTL1_UDRIEN_Pos              (4)                                               /*!< I2C_T::CTL1: UDRIEN Position           */
#define I2C_CTL1_UDRIEN_Msk              (0x1ul << I2C_CTL1_UDRIEN_Pos)                    /*!< I2C_T::CTL1: UDRIEN Mask               */

#define I2C_CTL1_TWOBUFEN_Pos            (5)                                               /*!< I2C_T::CTL1: TWOBUFEN Position         */
#define I2C_CTL1_TWOBUFEN_Msk            (0x1ul << I2C_CTL1_TWOBUFEN_Pos)                  /*!< I2C_T::CTL1: TWOBUFEN Mask             */

#define I2C_CTL1_PDMASTR_Pos             (8)                                               /*!< I2C_T::CTL1: PDMASTR Position          */
#define I2C_CTL1_PDMASTR_Msk             (0x1ul << I2C_CTL1_PDMASTR_Pos)                   /*!< I2C_T::CTL1: PDMASTR Mask              */

#define I2C_CTL1_ADDR10EN_Pos            (9)                                               /*!< I2C_T::CTL1: ADDR10EN Position         */
#define I2C_CTL1_ADDR10EN_Msk            (0x1ul << I2C_CTL1_ADDR10EN_Pos)                  /*!< I2C_T::CTL1: ADDR10EN Mask             */

#define I2C_CTL1_SWITCHEN_Pos            (10)                                              /*!< I2C_T::CTL1: SWITCHEN Position         */
#define I2C_CTL1_SWITCHEN_Msk            (0x1ul << I2C_CTL1_SWITCHEN_Pos)                  /*!< I2C_T::CTL1: SWITCHEN Mask             */

#define I2C_CTL1_STOPIEN_Pos             (12)                                              /*!< I2C_T::CTL1: STOPIEN Position          */
#define I2C_CTL1_STOPIEN_Msk             (0x1ul << I2C_CTL1_STOPIEN_Pos)                   /*!< I2C_T::CTL1: STOPIEN Mask              */

#define I2C_CTL1_DPBITSEL_Pos            (16)                                              /*!< I2C_T::CTL1: DPBITSEL Position         */
#define I2C_CTL1_DPBITSEL_Msk            (0x3ul << I2C_CTL1_DPBITSEL_Pos)                  /*!< I2C_T::CTL1: DPBITSEL Mask             */

#define I2C_CTL1_DPCINTEN_Pos            (20)                                              /*!< I2C_T::CTL1: DPCINTEN Position         */
#define I2C_CTL1_DPCINTEN_Msk            (0x1ul << I2C_CTL1_DPCINTEN_Pos)                  /*!< I2C_T::CTL1: DPCINTEN Mask             */

#define I2C_CTL1_SRCINTEN_Pos            (21)                                              /*!< I2C_T::CTL1: SRCINTEN Position         */
#define I2C_CTL1_SRCINTEN_Msk            (0x1ul << I2C_CTL1_SRCINTEN_Pos)                  /*!< I2C_T::CTL1: SRCINTEN Mask             */

#define I2C_CTL1_FIFOEN_Pos              (24)                                              /*!< I2C_T::CTL1: FIFOEN Position           */
#define I2C_CTL1_FIFOEN_Msk              (0x1ul << I2C_CTL1_FIFOEN_Pos)                    /*!< I2C_T::CTL1: FIFOEN Mask               */

#define I2C_CTL1_FIFORST_Pos             (25)                                              /*!< I2C_T::CTL1: FIFORST Position          */
#define I2C_CTL1_FIFORST_Msk             (0x1ul << I2C_CTL1_FIFORST_Pos)                   /*!< I2C_T::CTL1: FIFORST Mask              */

#define I2C_CTL1_FIFOTHRES_Pos           (28)                                              /*!< I2C_T::CTL1: FIFOTHRES Position        */
#define I2C_CTL1_FIFOTHRES_Msk           (0x3ul << I2C_CTL1_FIFOTHRES_Pos)                 /*!< I2C_T::CTL1: FIFOTHRES Mask            */

#define I2C_STATUS1_ADMAT0_Pos           (0)                                               /*!< I2C_T::STATUS1: ADMAT0 Position        */
#define I2C_STATUS1_ADMAT0_Msk           (0x1ul << I2C_STATUS1_ADMAT0_Pos)                 /*!< I2C_T::STATUS1: ADMAT0 Mask            */

